UNetSCNManual(
  (input_layer): InputLayer()
  (SC1): SubmanifoldConvolution 1->5 C3
  (middle_conv): Sequential(
    (0): Sequential(
      (0): BatchNormLeakyReLU(35,eps=0.0001,momentum=0.99,affine=True,leakiness=0)
      (1): SubmanifoldConvolution 35->35 C3
    )
  )
  (BNReLU): BatchNormReLU(5,eps=0.0001,momentum=0.99,affine=True)
  (output_layer): OutputLayer()
)